In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [3]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [4]:
obj['b']

1.0

In [5]:
obj[1]

1.0

In [6]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [7]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [8]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [9]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [10]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [11]:
obj['b':'c'] = 5

In [12]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [13]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New york'],
                    columns = ['One', 'Two', 'Three', 'Four'])

In [14]:
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [15]:
data['Two']

Ohio         1
Colorado     5
Utah         9
New york    13
Name: Two, dtype: int32

In [16]:
data[['Three', 'One']]

          Three  One
Ohio          2    0
Colorado      6    4
Utah         10    8
New york     14   12

In [17]:
data[:2]

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [18]:
data[data['Three'] > 5]

          One  Two  Three  Four
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [19]:
data < 5

            One    Two  Three   Four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New york  False  False  False  False

In [20]:
data[data < 5]

          One  Two  Three  Four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New york  NaN  NaN    NaN   NaN

In [21]:
data[data < 5] = 0

In [22]:
data

          One  Two  Three  Four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

# Selection with loc and iloc

In [23]:
data.loc['Colorado', ['Two', 'Three']]

Two      5
Three    6
Name: Colorado, dtype: int32

In [24]:
data.iloc[2, [3, 0, 1]]

Four    11
One      8
Two      9
Name: Utah, dtype: int32

In [25]:
data.iloc[2]

One       8
Two       9
Three    10
Four     11
Name: Utah, dtype: int32

In [26]:
data.iloc[[1,2],[3,0,1]]

          Four  One  Two
Colorado     7    0    5
Utah        11    8    9

In [27]:
data.loc['Utah', 'Two']

9

In [28]:
data.loc[:'Utah', 'Two']

Ohio        0
Colorado    5
Utah        9
Name: Two, dtype: int32

In [29]:
data.iloc[:, :3][data.Three > 5]

          One  Two  Three
Colorado    0    5      6
Utah        8    9     10
New york   12   13     14